In [1]:
###Importing the important libraries needed for Data Manipulation, classification and Analysis

import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
%matplotlib inline 
import seaborn as sns 
from sklearn.datasets import load_digits 
digits = load_digits() 
from sklearn.model_selection import train_test_split 
from sklearn.linear_model import LogisticRegression 
from sklearn import metrics

from sklearn.impute import SimpleImputer

In [18]:
# Import data using predefined file path
data_file1 = "train.csv" 
df_train= pd.read_csv(data_file1)
# Importing data using user defined file path
df_test = pd.read_csv('test.csv')
df_gender_submission = pd.read_csv('gender_submission.csv')

# Merge the dataset using PassengerId as a key and using right join 
# (all the rows from df_gender_submission and only matching rows from df_test)
result = pd.merge(df_gender_submission, df_test, how = "right", on = ["PassengerId"])
# Concatenating df_train and result dataframe
train_df = pd.concat([df_train, result], ignore_index=True)

# Print first few rows
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [19]:
train_df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [20]:
# Check data types
train_df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [16]:
train_df.shape

(891, 12)

In [21]:
# check the unique values count
print("Number of unique values in each columns")
for col in train_df.columns:
    print(str(col)+ "   " + str(train_df[col].nunique()))

print('''It is clear when look at the number of unique values that there are\n
â€¢\t {train_df.PassengerId.nunique()} unique values in the PassengerId column. 
However, only {train_df.PassengerId.nunique()} unique values in the Name column. 
This raise the suspision that there may be duplicate entry in the data set''')

Number of unique values in each columns
PassengerId   1309
Survived   2
Pclass   3
Name   1307
Sex   2
Age   98
SibSp   7
Parch   8
Ticket   929
Fare   281
Cabin   186
Embarked   3

In [ ]:
#TODO %%%%%%%%%%%%%% Need to write code to check and remove duplicate values

In [25]:
print("\tData description") 
print("*****************************************") 

''' Within the three quatition (i.e """ """), it is posible to display a pragraph as it is.
Therefore new line can be enter typing a sentence in a new line or using \n'''
print("""â€¢\tPassengerId: Id of every passenger.\nâ€¢\tSurvived: This feature have value 0 and 1. 0 for not survived and 1 for survived.
â€¢\tPclass: There are 3 classes: Class 1, Class 2 and Class 3.\nâ€¢\tName: Name of passenger.\nâ€¢\tSex: Gender of passenger.
â€¢\tAge: Age of passenger.\nâ€¢\tSibSp: Indication that passenger have siblings and spouse.\nâ€¢\tParch: Whether a passenger is alone or have family.
â€¢\tTicket: Ticket number of passenger.\nâ€¢\tFare: Indicating the fare.\nâ€¢\tCabin: The cabin of passenger.\nâ€¢\tEmbarked: The embarked category""")

	Data description
*****************************************
â€¢	PassengerId: Id of every passenger.
â€¢	Survived: This feature have value 0 and 1. 0 for not survived and 1 for survived.
â€¢	Pclass: There are 3 classes: Class 1, Class 2 and Class 3.
â€¢	Name: Name of passenger.
â€¢	Sex: Gender of passenger.
â€¢	Age: Age of passenger.
â€¢	SibSp: Indication that passenger have siblings and spouse.
â€¢	Parch: Whether a passenger is alone or have family.
â€¢	Ticket: Ticket number of passenger.
â€¢	Fare: Indicating the fare.
â€¢	Cabin: The cabin of passenger.
â€¢	Embarked: The embarked category

## Transforming the column values
### Transforming Survived and Pclass columns from integer to String
Values are transformed form numerical values to categotical values as it is easier to understand the data in the exploratary analysis.
Also, after the transformation, graph lables become more discriptive and easier to understand.

### Renaming Embarked column values to their proper Embarcation port
This will make data more understandable in data exploration.

In [5]:
# Survived column values: maped 1 -> Survived and 0 -> Deceased
train_df.loc[train_df['Survived'] == 0, 'Survived'] = 'Deceased' 
train_df.loc[train_df['Survived'] == 1, 'Survived'] = 'Survived' 
train_df['Survived'].head()

0    Deceased
1    Survived
2    Survived
3    Survived
4    Deceased
Name: Survived, dtype: object

In [6]:
# Pclass column values: maped 1 -> First Class, 2 -> Second Class and 3 -> Third Class
train_df.loc[train_df['Pclass'] == 1, 'Pclass'] = 'First Class' 
train_df.loc[train_df['Pclass'] == 2, 'Pclass'] = 'Second Class' 
train_df.loc[train_df['Pclass'] == 3, 'Pclass'] = 'Third Class' 
train_df['Pclass'].head()

0    Third Class
1    First Class
2    Third Class
3    First Class
4    Third Class
Name: Pclass, dtype: object

In [7]:
# Embarked column values: maped C -> Cherbourg, Q -> Queenstown and S -> Southampton
train_df.loc[train_df['Embarked'] == 'C', 'Embarked'] = 'Cherbourg' 
train_df.loc[train_df['Embarked'] == 'Q', 'Embarked'] = 'Queenstown' 
train_df.loc[train_df['Embarked'] == 'S', 'Embarked'] = 'Southampton'
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,Deceased,Third Class,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,Southampton
1,2,Survived,First Class,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,Cherbourg
2,3,Survived,Third Class,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,Southampton
3,4,Survived,First Class,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,Southampton
4,5,Deceased,Third Class,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,Southampton

In [8]:
#The average age of passengers? 
train_df["Age"].mean()

29.69911764705882

In [9]:
#TODO%%%%%%%%%%%% WE NEED CHECH THIS @Bassey
# Median Age and Ticket fare price of Pax
train_df[["Age", "Fare"]].median()
train_df.describe(include="all")

#instead of using the predifined "describe function" we can combined aggregating statistics 
train_df.agg( 
    { 
        "Age": ['min', 'max', 'mean', 'median', 'skew'], 
        "Fare": ['min', 'max', 'mean', 'median', 'skew'], 
    } )

              Age        Fare
min      0.420000    0.000000
max     80.000000  512.329200
mean    29.699118   32.204208
median  28.000000   14.454200
skew     0.389108    4.787317

In [10]:
#counting by group
train_df.groupby("Pclass")["Pclass"].count()

Pclass
First Class     216
Second Class    184
Third Class     491
Name: Pclass, dtype: int64

In [11]:
train_df.isnull()  # is any missing values in dataframe
train_df.isnull().any()  # is any missing values across columns
train_df.isnull().sum().sum()   # count of missing values of the entire dataframe
count_NAN = len(train_df) - train_df.count() # count of missing values across columns
count_NAN

for i in range(len(train_df.index)):  # count of missing values across rows
    print("NAN in row ", i , " : ", train_df.iloc[i].isnull().sum())

NAN in row  0  :  1
NAN in row  1  :  0
NAN in row  2  :  1
NAN in row  3  :  0
NAN in row  4  :  1
NAN in row  5  :  2
NAN in row  6  :  0
NAN in row  7  :  1
NAN in row  8  :  1
NAN in row  9  :  1
NAN in row  10  :  0
NAN in row  11  :  0
NAN in row  12  :  1
NAN in row  13  :  1
NAN in row  14  :  1
NAN in row  15  :  1
NAN in row  16  :  1
NAN in row  17  :  2
NAN in row  18  :  1
NAN in row  19  :  2
NAN in row  20  :  1
NAN in row  21  :  0
NAN in row  22  :  1
NAN in row  23  :  0
NAN in row  24  :  1
NAN in row  25  :  1
NAN in row  26  :  2
NAN in row  27  :  0
NAN in row  28  :  2
NAN in row  29  :  2
NAN in row  30  :  1
NAN in row  31  :  1
NAN in row  32  :  2
NAN in row  33  :  1
NAN in row  34  :  1
NAN in row  35  :  1
NAN in row  36  :  2
NAN in row  37  :  1
NAN in row  38  :  1
NAN in row  39  :  1
NAN in row  40  :  1
NAN in row  41  :  1
NAN in row  42  :  2
NAN in row  43  :  1
NAN in row  44  :  1
NAN in row  45  :  2
NAN in row  46  :  2
NAN in row  47  :  2
NAN in row  48  :  2
NAN in row  49  :  1
NAN in row  50  :  1
NAN in row  51  :  1
NAN in row  52  :  0
NAN in row  53  :  1
NAN in row  54  :  0
NAN in row  55  :  1
NAN in row  56  :  1
NAN in row  57  :  1
NAN in row  58  :  1
NAN in row  59  :  1
NAN in row  60  :  1
NAN in row  61  :  1
NAN in row  62  :  0
NAN in row  63  :  1
NAN in row  64  :  2
NAN in row  65  :  2
NAN in row  66  :  0
NAN in row  67  :  1
NAN in row  68  :  1
NAN in row  69  :  1
NAN in row  70  :  1
NAN in row  71  :  1
NAN in row  72  :  1
NAN in row  73  :  1
NAN in row  74  :  1
NAN in row  75  :  0
NAN in row  76  :  2
NAN in row  77  :  2
NAN in row  78  :  1
NAN in row  79  :  1
NAN in row  80  :  1
NAN in row  81  :  1
NAN in row  82  :  2
NAN in row  83  :  1
NAN in row  84  :  1
NAN in row  85  :  1
NAN in row  86  :  1
NAN in row  87  :  2
NAN in row  88  :  0
NAN in row  89  :  1
NAN in row  90  :  1
NAN in row  91  :  1
NAN in row  92  :  0
NAN in row  93  :  1
NAN in row  94  :  1
NAN in row  95  :  2
NAN in row  96  :  0
NAN in row  97  :  0
NAN in row  98  :  1
NAN in row  99  :  1
NAN in row  100  :  1
NAN in row  101  :  2
NAN in row  102  :  0
NAN in row  103  :  1
NAN in row  104  :  1
NAN in row  105  :  1
NAN in row  106  :  1
NAN in row  107  :  2
NAN in row  108  :  1
NAN in row  109  :  2
NAN in row  110  :  0
NAN in row  111  :  1
NAN in row  112  :  1
NAN in row  113  :  1
NAN in row  114  :  1
NAN in row  115  :  1
NAN in row  116  :  1
NAN in row  117  :  1
NAN in row  118  :  0
NAN in row  119  :  1
NAN in row  120  :  1
NAN in row  121  :  2
NAN in row  122  :  1
NAN in row  123  :  0
NAN in row  124  :  0
NAN in row  125  :  1
NAN in row  126  :  2
NAN in row  127  :  1
NAN in row  128  :  1
NAN in row  129  :  1
NAN in row  130  :  1
NAN in row  131  :  1
NAN in row  132  :  1
NAN in row  133  :  1
NAN in row  134  :  1
NAN in row  135  :  1
NAN in row  136  :  0
NAN in row  137  :  0
NAN in row  138  :  1
NAN in row  139  :  0
NAN in row  140  :  2
NAN in row  141  :  1
NAN in row  142  :  1
NAN in row  143  :  1
NAN in row  144  :  1
NAN in row  145  :  1
NAN in row  146  :  1
NAN in row  147  :  1
NAN in row  148  :  0
NAN in row  149  :  1
NAN in row  150  :  1
NAN in row  151  :  0
NAN in row  152  :  1
NAN in row  153  :  1
NAN in row  154  :  2
NAN in row  155  :  1
NAN in row  156  :  1
NAN in row  157  :  1
NAN in row  158  :  2
NAN in row  159  :  2
NAN in row  160  :  1
NAN in row  161  :  1
NAN in row  162  :  1
NAN in row  163  :  1
NAN in row  164  :  1
NAN in row  165  :  1
NAN in row  166  :  1
NAN in row  167  :  1
NAN in row  168  :  2
NAN in row  169  :  1
NAN in row  170  :  0
NAN in row  171  :  1
NAN in row  172  :  1
NAN in row  173  :  1
NAN in row  174  :  0
NAN in row  175  :  1
NAN in row  176  :  2
NAN in row  177  :  0
NAN in row  178  :  1
NAN in row  179  :  1
NAN in row  180  :  2
NAN in row  181  :  2
NAN in row  182  :  1
NAN in row  183  :  0
NAN in row  184  :  1
NAN in row  185  :  1
NAN in row  186  :  2
NAN in row  187  :  1
NAN in row  188  :  1
NAN in row  189  :  1
NAN in row  190  :  1
NAN in row  191  :  1
NAN in row  192  :  1
NAN in row  193  :  0
NAN in row  194  :  0
NAN in row  195  :  0
NAN in row  196  :  2
NAN in row  197  :  1
NAN in row  198  :  2
NAN in row  199  :  1
NAN in row  200  :  1
NAN in row  201  :  2
NAN in row  202  :  1
NAN in row  203  :  1
NAN in row  204  :  1
NAN in row  205  :  0
NAN in row  206  :  1
NAN in row  207  :  1
NAN in row  208  :  1
NAN in row  209  :  0
NAN in row  210  :  1
NAN in row  211  :  1
NAN in row  212  :  1
NAN in row  213  :  1
NAN in row  214  :  2
NAN in row  215  :  0
NAN in row  216  :  1
NAN in row  217  :  1
NAN in row  218  :  0
NAN in row  219  :  1
NAN in row  220  :  1
NAN in row  221  :  1
NAN in row  222  :  1
NAN in row  223  :  2
NAN in row  224  :  0
NAN in row  225  :  1
NAN in row  226  :  1
NAN in row  227  :  1
NAN in row  228  :  1
NAN in row  229  :  2
NAN in row  230  :  0
NAN in row  231  :  1
NAN in row  232  :  1
NAN in row  233  :  1
NAN in row  234  :  1
NAN in row  235  :  2
NAN in row  236  :  1
NAN in row  237  :  1
NAN in row  238  :  1
NAN in row  239  :  1
NAN in row  240  :  2
NAN in row  241  :  2
NAN in row  242  :  1
NAN in row  243  :  1
NAN in row  244  :  1
NAN in row  245  :  0
NAN in row  246  :  1
NAN in row  247  :  1
NAN in row  248  :  0
NAN in row  249  :  1
NAN in row  250  :  2
NAN in row  251  :  0
NAN in row  252  :  0
NAN in row  253  :  1
NAN in row  254  :  1
NAN in row  255  :  1
NAN in row  256  :  2
NAN in row  257  :  0
NAN in row  258  :  1
NAN in row  259  :  1
NAN in row  260  :  2
NAN in row  261  :  1
NAN in row  262  :  0
NAN in row  263  :  0
NAN in row  264  :  2
NAN in row  265  :  1
NAN in row  266  :  1
NAN in row  267  :  1
NAN in row  268  :  0
NAN in row  269  :  0
NAN in row  270  :  2
NAN in row  271  :  1
NAN in row  272  :  1
NAN in row  273  :  0
NAN in row  274  :  2
NAN in row  275  :  0
NAN in row  276  :  1
NAN in row  277  :  2
NAN in row  278  :  1
NAN in row  279  :  1
NAN in row  280  :  1
NAN in row  281  :  1
NAN in row  282  :  1
NAN in row  283  :  1
NAN in row  284  :  1
NAN in row  285  :  1
NAN in row  286  :  1
NAN in row  287  :  1
NAN in row  288  :  1
NAN in row  289  :  1
NAN in row  290  :  1
NAN in row  291  :  0
NAN in row  292  :  0
NAN in row  293  :  1
NAN in row  294  :  1
NAN in row  295  :  2
NAN in row  296  :  1
NAN in row  297  :  0
NAN in row  298  :  1
NAN in row  299  :  0
NAN in row  300  :  2
NAN in row  301  :  2
NAN in row  302  :  1
NAN in row  303  :  1
NAN in row  304  :  2
NAN in row  305  :  0
NAN in row  306  :  2
NAN in row  307  :  0
NAN in row  308  :  1
NAN in row  309  :  0
NAN in row  310  :  0
NAN in row  311  :  0
NAN in row  312  :  1
NAN in row  313  :  1
NAN in row  314  :  1
NAN in row  315  :  1
NAN in row  316  :  1
NAN in row  317  :  1
NAN in row  318  :  0
NAN in row  319  :  0
NAN in row  320  :  1
NAN in row  321  :  1
NAN in row  322  :  1
NAN in row  323  :  1
NAN in row  324  :  2
NAN in row  325  :  0
NAN in row  326  :  1
NAN in row  327  :  0
NAN in row  328  :  1
NAN in row  329  :  0
NAN in row  330  :  2
NAN in row  331  :  0
NAN in row  332  :  0
NAN in row  333  :  1
NAN in row  334  :  2
NAN in row  335  :  2
NAN in row  336  :  0
NAN in row  337  :  0
NAN in row  338  :  1
NAN in row  339  :  0
NAN in row  340  :  0
NAN in row  341  :  0
NAN in row  342  :  1
NAN in row  343  :  1
NAN in row  344  :  1
NAN in row  345  :  0
NAN in row  346  :  1
NAN in row  347  :  2
NAN in row  348  :  1
NAN in row  349  :  1
NAN in row  350  :  1
NAN in row  351  :  1
NAN in row  352  :  1
NAN in row  353  :  1
NAN in row  354  :  2
NAN in row  355  :  1
NAN in row  356  :  0
NAN in row  357  :  1
NAN in row  358  :  2
NAN in row  359  :  2
NAN in row  360  :  1
NAN in row  361  :  1
NAN in row  362  :  1
NAN in row  363  :  1
NAN in row  364  :  2
NAN in row  365  :  1
NAN in row  366  :  0
NAN in row  367  :  2
NAN in row  368  :  2
NAN in row  369  :  0
NAN in row  370  :  0
NAN in row  371  :  1
NAN in row  372  :  1
NAN in row  373  :  1
NAN in row  374  :  1
NAN in row  375  :  2
NAN in row  376  :  1
NAN in row  377  :  0
NAN in row  378  :  1
NAN in row  379  :  1
NAN in row  380  :  1
NAN in row  381  :  1
NAN in row  382  :  1
NAN in row  383  :  1
NAN in row  384  :  2
NAN in row  385  :  1
NAN in row  386  :  1
NAN in row  387  :  1
NAN in row  388  :  2
NAN in row  389  :  1
NAN in row  390  :  0
NAN in row  391  :  1
NAN in row  392  :  1
NAN in row  393  :  0
NAN in row  394  :  0
NAN in row  395  :  1
NAN in row  396  :  1
NAN in row  397  :  1
NAN in row  398  :  1
NAN in row  399  :  1
NAN in row  400  :  1
NAN in row  401  :  1
NAN in row  402  :  1
NAN in row  403  :  1
NAN in row  404  :  1
NAN in row  405  :  1
NAN in row  406  :  1
NAN in row  407  :  1
NAN in row  408  :  1
NAN in row  409  :  2
NAN in row  410  :  2
NAN in row  411  :  2
NAN in row  412  :  0
NAN in row  413  :  2
NAN in row  414  :  1
NAN in row  415  :  2
NAN in row  416  :  1
NAN in row  417  :  1
NAN in row  418  :  1
NAN in row  419  :  1
NAN in row  420  :  2
NAN in row  421  :  1
NAN in row  422  :  1
NAN in row  423  :  1
NAN in row  424  :  1
NAN in row  425  :  2
NAN in row  426  :  1
NAN in row  427  :  1
NAN in row  428  :  2
NAN in row  429  :  0
NAN in row  430  :  0
NAN in row  431  :  2
NAN in row  432  :  1
NAN in row  433  :  1
NAN in row  434  :  0
NAN in row  435  :  0
NAN in row  436  :  1
NAN in row  437  :  1
NAN in row  438  :  0
NAN in row  439  :  1
NAN in row  440  :  1
NAN in row  441  :  1
NAN in row  442  :  1
NAN in row  443  :  1
NAN in row  444  :  2
NAN in row  445  :  0
NAN in row  446  :  1
NAN in row  447  :  1
NAN in row  448  :  1
NAN in row  449  :  0
NAN in row  450  :  1
NAN in row  451  :  2
NAN in row  452  :  0
NAN in row  453  :  0
NAN in row  454  :  2
NAN in row  455  :  1
NAN in row  456  :  0
NAN in row  457  :  1
NAN in row  458  :  1
NAN in row  459  :  2
NAN in row  460  :  0
NAN in row  461  :  1
NAN in row  462  :  0
NAN in row  463  :  1
NAN in row  464  :  2
NAN in row  465  :  1
NAN in row  466  :  2
NAN in row  467  :  1
NAN in row  468  :  2
NAN in row  469  :  1
NAN in row  470  :  2
NAN in row  471  :  1
NAN in row  472  :  1
NAN in row  473  :  0
NAN in row  474  :  1
NAN in row  475  :  1
NAN in row  476  :  1
NAN in row  477  :  1
NAN in row  478  :  1
NAN in row  479  :  1
NAN in row  480  :  1
NAN in row  481  :  2
NAN in row  482  :  1
NAN in row  483  :  1
NAN in row  484  :  0
NAN in row  485  :  2
NAN in row  486  :  0
NAN in row  487  :  0
NAN in row  488  :  1
NAN in row  489  :  1
NAN in row  490  :  2
NAN in row  491  :  1
NAN in row  492  :  0
NAN in row  493  :  1
NAN in row  494  :  1
NAN in row  495  :  2
NAN in row  496  :  0
NAN in row  497  :  2
NAN in row  498  :  0
NAN in row  499  :  1
NAN in row  500  :  1
NAN in row  501  :  1
NAN in row  502  :  2
NAN in row  503  :  1
NAN in row  504  :  0
NAN in row  505  :  0
NAN in row  506  :  1
NAN in row  507  :  2
NAN in row  508  :  1
NAN in row  509  :  1
NAN in row  510  :  1
NAN in row  511  :  2
NAN in row  512  :  0
NAN in row  513  :  1
NAN in row  514  :  1
NAN in row  515  :  0
NAN in row  516  :  0
NAN in row  517  :  2
NAN in row  518  :  1
NAN in row  519  :  1
NAN in row  520  :  0
NAN in row  521  :  1
NAN in row  522  :  2
NAN in row  523  :  0
NAN in row  524  :  2
NAN in row  525  :  1
NAN in row  526  :  1
NAN in row  527  :  1
NAN in row  528  :  1
NAN in row  529  :  1
NAN in row  530  :  1
NAN in row  531  :  2
NAN in row  532  :  1
NAN in row  533  :  2
NAN in row  534  :  1
NAN in row  535  :  1
NAN in row  536  :  0
NAN in row  537  :  1
NAN in row  538  :  2
NAN in row  539  :  0
NAN in row  540  :  0
NAN in row  541  :  1
NAN in row  542  :  1
NAN in row  543  :  1
NAN in row  544  :  0
NAN in row  545  :  1
NAN in row  546  :  1
NAN in row  547  :  2
NAN in row  548  :  1
NAN in row  549  :  1
NAN in row  550  :  0
NAN in row  551  :  1
NAN in row  552  :  2
NAN in row  553  :  1
NAN in row  554  :  1
NAN in row  555  :  1
NAN in row  556  :  0
NAN in row  557  :  2
NAN in row  558  :  0
NAN in row  559  :  1
NAN in row  560  :  2
NAN in row  561  :  1
NAN in row  562  :  1
NAN in row  563  :  2
NAN in row  564  :  2
NAN in row  565  :  1
NAN in row  566  :  1
NAN in row  567  :  1
NAN in row  568  :  2
NAN in row  569  :  1
NAN in row  570  :  1
NAN in row  571  :  0
NAN in row  572  :  0
NAN in row  573  :  2
NAN in row  574  :  1
NAN in row  575  :  1
NAN in row  576  :  1
NAN in row  577  :  0
NAN in row  578  :  2
NAN in row  579  :  1
NAN in row  580  :  1
NAN in row  581  :  0
NAN in row  582  :  1
NAN in row  583  :  0
NAN in row  584  :  2
NAN in row  585  :  0
NAN in row  586  :  1
NAN in row  587  :  0
NAN in row  588  :  1
NAN in row  589  :  2
NAN in row  590  :  1
NAN in row  591  :  0
NAN in row  592  :  1
NAN in row  593  :  2
NAN in row  594  :  1
NAN in row  595  :  1
NAN in row  596  :  2
NAN in row  597  :  1
NAN in row  598  :  2
NAN in row  599  :  0
NAN in row  600  :  1
NAN in row  601  :  2
NAN in row  602  :  2
NAN in row  603  :  1
NAN in row  604  :  1
NAN in row  605  :  1
NAN in row  606  :  1
NAN in row  607  :  1
NAN in row  608  :  1
NAN in row  609  :  0
NAN in row  610  :  1
NAN in row  611  :  2
NAN in row  612  :  2
NAN in row  613  :  2
NAN in row  614  :  1
NAN in row  615  :  1
NAN in row  616  :  1
NAN in row  617  :  1
NAN in row  618  :  0
NAN in row  619  :  1
NAN in row  620  :  1
NAN in row  621  :  0
NAN in row  622  :  1
NAN in row  623  :  1
NAN in row  624  :  1
NAN in row  625  :  0
NAN in row  626  :  1
NAN in row  627  :  0
NAN in row  628  :  1
NAN in row  629  :  2
NAN in row  630  :  0
NAN in row  631  :  1
NAN in row  632  :  0
NAN in row  633  :  2
NAN in row  634  :  1
NAN in row  635  :  1
NAN in row  636  :  1
NAN in row  637  :  1
NAN in row  638  :  1
NAN in row  639  :  2
NAN in row  640  :  1
NAN in row  641  :  0
NAN in row  642  :  1
NAN in row  643  :  2
NAN in row  644  :  1
NAN in row  645  :  0
NAN in row  646  :  1
NAN in row  647  :  0
NAN in row  648  :  2
NAN in row  649  :  1
NAN in row  650  :  2
NAN in row  651  :  1
NAN in row  652  :  1
NAN in row  653  :  2
NAN in row  654  :  1
NAN in row  655  :  1
NAN in row  656  :  2
NAN in row  657  :  1
NAN in row  658  :  1
NAN in row  659  :  0
NAN in row  660  :  1
NAN in row  661  :  1
NAN in row  662  :  0
NAN in row  663  :  1
NAN in row  664  :  1
NAN in row  665  :  1
NAN in row  666  :  1
NAN in row  667  :  2
NAN in row  668  :  1
NAN in row  669  :  1
NAN in row  670  :  1
NAN in row  671  :  0
NAN in row  672  :  1
NAN in row  673  :  1
NAN in row  674  :  2
NAN in row  675  :  1
NAN in row  676  :  1
NAN in row  677  :  1
NAN in row  678  :  1
NAN in row  679  :  0
NAN in row  680  :  2
NAN in row  681  :  0
NAN in row  682  :  1
NAN in row  683  :  1
NAN in row  684  :  1
NAN in row  685  :  1
NAN in row  686  :  1
NAN in row  687  :  1
NAN in row  688  :  1
NAN in row  689  :  0
NAN in row  690  :  0
NAN in row  691  :  1
NAN in row  692  :  2
NAN in row  693  :  1
NAN in row  694  :  1
NAN in row  695  :  1
NAN in row  696  :  1
NAN in row  697  :  2
NAN in row  698  :  0
NAN in row  699  :  0
NAN in row  700  :  0
NAN in row  701  :  0
NAN in row  702  :  1
NAN in row  703  :  1
NAN in row  704  :  1
NAN in row  705  :  1
NAN in row  706  :  1
NAN in row  707  :  0
NAN in row  708  :  1
NAN in row  709  :  2
NAN in row  710  :  0
NAN in row  711  :  1
NAN in row  712  :  0
NAN in row  713  :  1
NAN in row  714  :  1
NAN in row  715  :  0
NAN in row  716  :  0
NAN in row  717  :  0
NAN in row  718  :  2
NAN in row  719  :  1
NAN in row  720  :  1
NAN in row  721  :  1
NAN in row  722  :  1
NAN in row  723  :  1
NAN in row  724  :  0
NAN in row  725  :  1
NAN in row  726  :  1
NAN in row  727  :  2
NAN in row  728  :  1
NAN in row  729  :  1
NAN in row  730  :  0
NAN in row  731  :  1
NAN in row  732  :  2
NAN in row  733  :  1
NAN in row  734  :  1
NAN in row  735  :  1
NAN in row  736  :  1
NAN in row  737  :  0
NAN in row  738  :  2
NAN in row  739  :  2
NAN in row  740  :  1
NAN in row  741  :  0
NAN in row  742  :  0
NAN in row  743  :  1
NAN in row  744  :  1
NAN in row  745  :  0
NAN in row  746  :  1
NAN in row  747  :  1
NAN in row  748  :  0
NAN in row  749  :  1
NAN in row  750  :  1
NAN in row  751  :  0
NAN in row  752  :  1
NAN in row  753  :  1
NAN in row  754  :  1
NAN in row  755  :  1
NAN in row  756  :  1
NAN in row  757  :  1
NAN in row  758  :  1
NAN in row  759  :  0
NAN in row  760  :  2
NAN in row  761  :  1
NAN in row  762  :  1
NAN in row  763  :  0
NAN in row  764  :  1
NAN in row  765  :  0
NAN in row  766  :  2
NAN in row  767  :  1
NAN in row  768  :  2
NAN in row  769  :  1
NAN in row  770  :  1
NAN in row  771  :  1
NAN in row  772  :  0
NAN in row  773  :  2
NAN in row  774  :  1
NAN in row  775  :  1
NAN in row  776  :  1
NAN in row  777  :  1
NAN in row  778  :  2
NAN in row  779  :  0
NAN in row  780  :  1
NAN in row  781  :  0
NAN in row  782  :  0
NAN in row  783  :  2
NAN in row  784  :  1
NAN in row  785  :  1
NAN in row  786  :  1
NAN in row  787  :  1
NAN in row  788  :  1
NAN in row  789  :  0
NAN in row  790  :  2
NAN in row  791  :  1
NAN in row  792  :  2
NAN in row  793  :  2
NAN in row  794  :  1
NAN in row  795  :  1
NAN in row  796  :  0
NAN in row  797  :  1
NAN in row  798  :  1
NAN in row  799  :  1
NAN in row  800  :  1
NAN in row  801  :  1
NAN in row  802  :  0
NAN in row  803  :  1
NAN in row  804  :  1
NAN in row  805  :  1
NAN in row  806  :  0
NAN in row  807  :  1
NAN in row  808  :  1
NAN in row  809  :  0
NAN in row  810  :  1
NAN in row  811  :  1
NAN in row  812  :  1
NAN in row  813  :  1
NAN in row  814  :  1
NAN in row  815  :  1
NAN in row  816  :  1
NAN in row  817  :  1
NAN in row  818  :  1
NAN in row  819  :  1
NAN in row  820  :  0
NAN in row  821  :  1
NAN in row  822  :  1
NAN in row  823  :  0
NAN in row  824  :  1
NAN in row  825  :  2
NAN in row  826  :  2
NAN in row  827  :  1
NAN in row  828  :  2
NAN in row  829  :  1
NAN in row  830  :  1
NAN in row  831  :  1
NAN in row  832  :  2
NAN in row  833  :  1
NAN in row  834  :  1
NAN in row  835  :  0
NAN in row  836  :  1
NAN in row  837  :  2
NAN in row  838  :  1
NAN in row  839  :  1
NAN in row  840  :  1
NAN in row  841  :  1
NAN in row  842  :  1
NAN in row  843  :  1
NAN in row  844  :  1
NAN in row  845  :  1
NAN in row  846  :  2
NAN in row  847  :  1
NAN in row  848  :  1
NAN in row  849  :  1
NAN in row  850  :  1
NAN in row  851  :  1
NAN in row  852  :  1
NAN in row  853  :  0
NAN in row  854  :  1
NAN in row  855  :  1
NAN in row  856  :  1
NAN in row  857  :  0
NAN in row  858  :  1
NAN in row  859  :  2
NAN in row  860  :  1
NAN in row  861  :  1
NAN in row  862  :  0
NAN in row  863  :  2
NAN in row  864  :  1
NAN in row  865  :  1
NAN in row  866  :  1
NAN in row  867  :  0
NAN in row  868  :  2
NAN in row  869  :  1
NAN in row  870  :  1
NAN in row  871  :  0
NAN in row  872  :  0
NAN in row  873  :  1
NAN in row  874  :  1
NAN in row  875  :  1
NAN in row  876  :  1
NAN in row  877  :  1
NAN in row  878  :  2
NAN in row  879  :  0
NAN in row  880  :  1
NAN in row  881  :  1
NAN in row  882  :  1
NAN in row  883  :  1
NAN in row  884  :  1
NAN in row  885  :  1
NAN in row  886  :  1
NAN in row  887  :  0
NAN in row  888  :  2
NAN in row  889  :  0
NAN in row  890  :  1

In [12]:
#counting of missing values of a particular column
train_df.Age.isnull().sum()

177

In [13]:
# count of missing values of column by group
'''count of missing values of column by group
 Because we dont havve missing values in sex all the missing values is coming from Age'''
train_df.groupby(['Sex'])['Survived'].apply(lambda x: x.isnull().sum())

Sex
female    0
male      0
Name: Survived, dtype: int64

In [14]:
# Replacing the na in age column with mean
train_df["Age"] = train_df["Age"].fillna(round(train_df["Age"].mean()))
train_df["Age"].head()

#checking if there are any remaining missing value
train_df.Age.isnull().sum()

0

In [15]:
# Percentage of rows missing in each column

for column in train_df.columns:
    percentage = train_df[column].isnull().mean()
    print(f'{column}: {round(percentage*100,4)}%')

PassengerId: 0.0%
Survived: 0.0%
Pclass: 0.0%
Name: 0.0%
Sex: 0.0%
Age: 0.0%
SibSp: 0.0%
Parch: 0.0%
Ticket: 0.0%
Fare: 0.0%
Cabin: 77.1044%
Embarked: 0.2245%